brew "yabai"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "spacebar"
tap "homebrew/cask-fonts"
cask "homebrew/cask-fonts/font-fontawesome"

# stackline requires hammerspoon
cask "hammerspoon"

brew "fish"
brew "tmux"

# browsers
cask "firefox"
cask "google-chrome"

# terminal
cask "alacritty"
cask "kitty"

# coding
brew "neovim"
cask "visual-studio-code"
brew "asdf"
brew "direnv"

# tools
brew "coreutils"

# fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

cask "slack"

# Needed to build node-canvas?
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"


brew "starship"
brew "ansible"

# for fortune
brew "boxes"
brew "fortune"

brew "fzf"
brew "bat"

cask "platypus"

brew "lsusb"
cask "bitwarden"

cask "transmission"

cask "docker"
tap "aws/tap"
brew "aws-sam-cli"

brew "ripgrep"
cask "zoom"

cask "wireshark"
brew "hey"


brew "bash-language-server"

brew "tldr"
brew "yt-dlp"
brew "youtube-dl"

cask "godot"
cask "spotify"
cask "vlc"
brew "graphviz"
cask "anki"

cask "kap" # for taking screenshots
cask "keycastr" # to display keystrokes
brew "cmatrix" # aesthetics

brew "ffmpeg"


brew "syncthing"

# taskwarrior
brew "task"
brew "taskd"
brew "tasksh"

brew "timewarrior"
