brew "yabai"
brew "koekeishiya/formulae/skhd"
brew "spacebar"
tap "homebrew/cask-fonts"
cask "homebrew/cask-fonts/font-fontawesome"
brew "dmenu-mac"

brew "fish"
brew "tmux"

# browsers
cask "firefox"
cask "google-chrome"

# terminal
cask "alacritty"
cask "kitty"

# coding
brew "neovim"
cask "visual-studio-code"
brew "asdf"
brew "direnv"

# tools
brew "coreutils"


# fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

cask "slack"


brew "pkg-config"
brew "cairo"
brew "pango" 
brew "libpng" 
brew "jpeg" 
brew "giflib"
brew "librsvg"


brew "starship"

brew "ansible"

# for fortune
brew "boxes"
brew "fortune"

brew "fzf"
brew "bat"
