brew "yabai"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "spacebar"
tap "homebrew/cask-fonts"
cask "homebrew/cask-fonts/font-fontawesome"

# stackline requires hammerspoon
cask "hammerspoon"

brew "fish"
brew "tmux"

# browsers
cask "firefox"
cask "google-chrome"

# terminal
cask "alacritty"
cask "kitty"

# coding
brew "neovim"
cask "visual-studio-code"
brew "asdf"
brew "direnv"

# tools
brew "coreutils"

# fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

cask "slack"

cask "whatsapp"

# Needed to build node-canvas?
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"


brew "starship"
brew "ansible"

# Required for ansible
tap "esolitos/ipa"
brew "esolitos/ipa/sshpass"

# for fortune
brew "boxes"
brew "fortune"

brew "fzf"
brew "bat"

cask "platypus"

brew "lsusb"
cask "bitwarden"

cask "transmission"

cask "docker"
tap "aws/tap"
brew "aws-sam-cli"

brew "ripgrep"
cask "zoom"

cask "wireshark"
brew "hey"


brew "bash-language-server"

brew "tldr"
brew "yt-dlp"
brew "youtube-dl"

cask "godot"
cask "spotify"
cask "vlc"
brew "graphviz"
cask "anki"

cask "kap" # for taking screenshots
cask "licecap" # taking screenshots since kap is not working
#cask "loom"
cask "keycastr" # to display keystrokes
brew "cmatrix" # aesthetics

# https://github.com/audacity/audacity/issues/3747#issuecomment-2099741598
brew "ffmpeg@6"
brew "ffmpeg"
brew "libtiff" # needed when merging audio + video from reddit


brew "syncthing"

# taskwarrior
brew "task"
brew "taskd"
brew "tasksh"

brew "timewarrior"

# only used with timewarrior-status.sh
brew "gnu-sed"

# https://github.com/Homebrew/discussions/discussions/285
tap "carlocab/personal"
brew "carlocab/personal/unrar"

# to use with icat
brew "imagemagick"
brew "optipng"

# docker server replacement
brew "colima"

brew "act" # to test github actoins locally

cask "ngrok"

cask "visual-studio-code"

brew "rename"

cask "obs"
cask "audacity"

brew "nicotine-plus"

brew "kind"

cask "syncthing"

# https://gist.github.com/7468696e6b/ec8fa5d6cdb4e80633b9df95869b70c0
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
#brew "okular"
cask "gimp"

brew "wget"

# photos
cask "darktable"

brew "nginx"

brew "trash"

brew "git"
brew "protobuf"


cask "keyboardcleantool"

# To delete files in a git repo
brew "git-filter-repo"

brew "ncdu"

cask "launchcontrol"

brew "rsync"

brew "git-lfs"

brew "htop"

# needed for grafana stuff
brew "mage"

cask "discord"

tap "norwoodj/tap"
brew "helm-docs"

# pdf reader
# TODO: uninstall
#tap "zegervdv/zathura"
#brew "zathura"
brew "lesspipe"
cask "sioyek"

brew "aichat"

# backup
cask "duplicati"

# doesn't work with m1, need to install manually
#cask "virtualbox"
cask "vagrant"
brew "qemu"
# https://github.com/hashicorp/vagrant/issues/10644#issuecomment-1690022359
cask "vagrant-vmware-utility"

# steam deck
# didn't work
# curl: (22) The requested URL returned error: 404
#Error: Download failed on Cask 'kdeconnect' with message: Download failed: https://binary-factory.kde.org/view/MacOS/job/kdeconnect-kde_Release_macos/lastStableBuild/artifact/kdeconnect-kde--macos-64-clang.dmg
#cask "kde-mac/kde/kdeconnect"

# https://courses.pikuma.com/courses/take/game-physics-engine-programming/lessons/28513490-technologies-dependencies
brew "sdl2"
brew "sdl2_image"
brew "sdl2_gfx"

# https://old.reddit.com/r/vim/comments/iz4io9/how_would_i_go_about_linking_external_libraries/g6h1kui/
brew "bear"

# to be able to read markdown files locally
brew "mdcat"
cask "mark-text"
cask "obsidian"

cask "electron"

cask "adobe-creative-cloud"

# https://github.com/koekeishiya/yabai/issues/1889#issuecomment-1791066779
tap "FelixKratz/formulae"
brew "borders"

brew "npm"


# for nvim 
brew "pipx"
